In [10]:
import pandas as pd

### Q1. List any five functions of the pandas library with execution.

In [11]:
file=pd.read_csv("csv.csv")

1. "**pandas.dypes** funcion used to know the *datatype's* of the column series  
*Example:-*

In [12]:
file.dtypes

Index                   int64
Organization Id        object
Name                   object
Website                object
Country                object
Description            object
Founded                 int64
Industry               object
Number of employees     int64
dtype: object

2. **pandas.head()** funcion is used to print the first 5 row by default and also we can print the number of row by passing a argument into the head() function  
*Example:-*

In [13]:
file.head()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
0,1,FAB0d41d5b5d22c,Ferrell LLC,https://price.net/,Papua New Guinea,Horizontal empowering knowledgebase,1990,Plastics,3498
1,2,6A7EdDEA9FaDC52,"Mckinney, Riley and Day",http://www.hall-buchanan.info/,Finland,User-centric system-worthy leverage,2015,Glass / Ceramics / Concrete,4952
2,3,0bFED1ADAE4bcC1,Hester Ltd,http://sullivan-reed.com/,China,Switchable scalable moratorium,1971,Public Safety,5287
3,4,2bFC1Be8a4ce42f,Holder-Sellers,https://becker.com/,Turkmenistan,De-engineered systemic artificial intelligence,2004,Automotive,921
4,5,9eE8A6a4Eb96C24,Mayer Group,http://www.brewer.com/,Mauritius,Synchronized needs-based challenge,1991,Transportation,7870

3. **pandas["series_name"]** function is used to print the *series* data by giving the column name  
*Example:-*

In [14]:
file['Country']

0                Papua New Guinea
1                         Finland
2                           China
3                    Turkmenistan
4                       Mauritius
                 ...
95                       Ethiopia
96                       Anguilla
97    Falkland Islands (Malvinas)
98                Kyrgyz Republic
99                           Togo
Name: Country, Length: 100, dtype: object

4. **pandas.tail()** function is used to print the last 5 row's by default also we can pass the *argument* as a int to print the number of row's. this function is same as the fuction **pandas.tail()**  
*Example:-**

In [15]:
file.tail()

,Index,Organization Id,Name,Website,Country,Description,Founded,Industry,Number of employees
95,96,0a0bfFbBbB8eC7c,Holmes Group,https://mcdowell.org/,Ethiopia,Right-sized zero tolerance focus group,1975,Photography,2988
96,97,BA6Cd9Dae2Efd62,Good Ltd,http://duffy.com/,Anguilla,Reverse-engineered composite moratorium,1971,Consumer Services,4292
97,98,E7df80C60Abd7f9,Clements-Espinoza,http://www.flowers.net/,Falkland Islands (Malvinas),Progressive modular hub,1991,Broadcast Media,236
98,99,AFc285dbE2fEd24,Mendez Inc,https://www.burke.net/,Kyrgyz Republic,User-friendly exuding migration,1993,Education Management,339
99,100,e9eB5A60Cef8354,Watkins-Kaiser,http://www.herring.com/,Togo,Synergistic background access,2009,Financial Services,2785

5. **pandas.describe()** funtion give's the discription about all the data which are *int* type. it give's info liek mean,std,min,count   
*Example:-*

In [16]:
file.describe()

            Index      Founded  Number of employees
count  100.000000   100.000000           100.000000
mean    50.500000  1995.410000          4964.860000
std     29.011492    15.744228          2850.859799
min      1.000000  1970.000000           236.000000
25%     25.750000  1983.500000          2741.250000
50%     50.500000  1995.000000          4941.500000
75%     75.250000  2010.250000          7558.000000
max    100.000000  2021.000000          9995.000000

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [17]:
#creating a dataframe with column "A",B & C
data={'A':[1,5,6,2,4,10],
    'B':[2,3,6,2,5,1],
    'C':[13,23,52,52,5,1]
    }
df=pd.DataFrame(data)

Creating a function for reindexing the dataframe

In [18]:
def func(df):
    reindex=range(1,len(df)*2,2)
    new_df=df.copy()
    new_df.index=reindex
    return new_df

Before Reindexing

In [19]:
df

    A  B   C
0   1  2  13
1   5  3  23
2   6  6  52
3   2  2  52
4   4  5   5
5  10  1   1

Calling a function for reindexing the dataframe

In [20]:
func(df)

     A  B   C
1    1  2  13
3    5  3  23
5    6  6  52
7    2  2  52
9    4  5   5
11  10  1   1

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.  

### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [21]:
l=[10, 20, 30, 40, 50]
data1={'values':pd.Series(l)}
df1=pd.DataFrame(data1)

Creating a function

In [22]:
def find_sum(data_frame):
    sum_of_3=sum(data_frame['values'][0:3])
    return sum_of_3

creating a sum of first three values in the column by using function

In [23]:
find_sum(df1)

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

creating a dataframe with a **Text** column

In [24]:
countries={"Text":["India","America","Germany","Sweden","Thailand","Indonesia"]}
df2=pd.DataFrame(countries)

Creating a function which will count the length of the **Text** and will add new column **Word_Column**

In [25]:
def length_counter(df):
    text=df["Text"]
    counter=text.apply(len)
    df["Word_Count"]=counter
    return "Word_Count Added Successfully"

Calling function, which wil find the length of the Text and will create a new column i.e word_count

In [26]:
length_counter(df2)

'Word_Count Added Successfully'

Printing the function after finding the length

In [27]:
df2

        Text  Word_Count
0      India           5
1    America           7
2    Germany           7
3     Sweden           6
4   Thailand           8
5  Indonesia           9

### Q5. How are DataFrame.size() and DataFrame.shape() different?

**DataFrame.size**

DataFrame.size represents the total number of elements in the DataFrame, calculated by multiplying the number of rows by the number of columns. It returns an integer value.
For instance, if you have a DataFrame with 5 rows and 3 columns, DataFrame.size will return **5 * 3 = 15**

**DataFrame.shape**

DataFrame.shape is an attribute that returns a tuple representing the dimensions of the DataFrame in the format (number_of_rows, number_of_columns).
For example, if you have a DataFrame with 5 rows and 3 columns, DataFrame.shape will return **(5, 3).**

### Q6. Which function of pandas do we use to read an excel file?

In pandas for reading **excel** file we use **pandas.read_excel()** function. which allow us to read the data stored in the excel file and store it in a dataframe  
After creating the **DataFrame** we can apply all the function's of the pandas as we apply in the for reading & modifying  the **csv & html** file  

*Example:* Applying the pandas function to the excel file

In [28]:
excel=pd.read_excel('excel.xls')

In [29]:
excel.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

In [30]:
excel['Last Name']

0          Abril
1      Hashimoto
2           Gent
3         Hanner
4        Magwood
         ...
95    Lafollette
96          Cail
97         Abbey
98          Danz
99        Alkire
Name: Last Name, Length: 100, dtype: object

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

##### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [31]:
sample_emails={'Email':['swarajsingh@gmail.com','sibbu453@gmail.com','torque32@gmail.com','mau235@gmail.com']}

Creating a dataframe with variable *email* & also creating a another which wil contain the data of *Email* Column in Dataframe

In [32]:
email=pd.DataFrame(sample_emails)
e=email["Email"]

Creating a **Function** which Extract the username from the **Email**

In [33]:
def username_extracter(email):
    username=''
    count=0
    for i in email:
            if i=='@':
                break
            count+=1
    username=email[0:count]
    return username

Creating a New column **Usename** in the *Email* DataFrame

In [34]:
email["Username"]=e.apply(username_extracter)

Printing a DataFrame after adding a new column into it

In [35]:
email

                   Email     Username
0  swarajsingh@gmail.com  swarajsingh
1     sibbu453@gmail.com     sibbu453
2     torque32@gmail.com     torque32
3       mau235@gmail.com       mau235

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
### all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
### function should return a new DataFrame that contains only the selected rows.
### For example, if df contains the following values:
A B C  
0 3 5 1  
1 8 2 7  
2 6 9 4  
3 2 3 5  
4 9 1 2  

##### Your function should select the following rows: A B C
1 8 2 7  
4 9 1 2  
##### The function should return a new DataFrame that contains only the selected rows.

In [36]:
data = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
}
df = pd.DataFrame(data)  #created a Dataframe with name df

def filter_dataframe(df):                             #Defining a function which will eliminate the value's as per the condition
    rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return rows

result_df = filter_dataframe(df)
print(result_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

Defing a DataFrame which has a Column **Value's**

In [37]:
df9=pd.DataFrame({'Values':[5,24,63,78,25,15]})

Defing a Function which wil find the **mean, median & Standard Deviation**

In [38]:
def describer(df):
    d=df["Values"]
    print(f"Mean is : {d.mean()}")
    print(f"Median is : {d.median()}")
    print(f"Standard Deviation is :{d.std()}")

Calling a Defind Function which wil print the mean meadian & std

In [39]:
describer(df9)

Mean is : 35.0
Median is : 24.5
Standard Deviation is :28.823601440486232

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [40]:
s = {
    'Sales': [235, 352, 552, 562, 643, 324, 287, 985, 534, 987, 457, 657, 345, 811, 1025, 1265, 928, 356, 654, 782, 1111, 1126, 1235, 1320, 1435, 1480, 1504, 2534, 2234, 1387, 1645, 1732, 1900, 2001, 1838, 2297, 2503],
    'Date': ['23-11-12', '23-11-13', '23-11-14', '23-11-15', '23-11-16', '23-11-17', '23-11-18', '23-11-19', '23-11-20', '23-11-21', '23-11-22', '23-11-23', '23-11-24', '23-11-25', '23-11-26', '23-11-27', '23-11-28', '23-11-29', '23-11-30', '23-12-01', '23-12-02', '23-12-03', '23-12-04', '23-12-05', '23-12-06', '23-12-07', '23-12-08', '23-12-09', '23-12-10', '23-12-11', '23-12-12', '23-12-13', '23-12-14', '23-12-15', '23-12-16', '23-12-17', '23-12-18']
}

Creating a DataFrame using above cell data

In [41]:
df=pd.DataFrame(s)

Defing a Function which will claculate the moving Average of each row's and will create a new Column with Name **Moving Average**

In [42]:
def MA(df):
    d=df["Sales"]
    ma=d.rolling(window=7,min_periods=1).mean()
    df['Moving Average']=ma
    return "New Column Created Successfully with name 'Moving Average'"

Callling a Function

In [43]:
MA(df)

"New Column Created Successfully with name 'Moving Average'"

New Column added with name **Moving Average**

In [44]:
df.head(10)

   Sales      Date  Moving Average
0    235  23-11-12      235.000000
1    352  23-11-13      293.500000
2    552  23-11-14      379.666667
3    562  23-11-15      425.250000
4    643  23-11-16      468.800000
5    324  23-11-17      444.666667
6    287  23-11-18      422.142857
7    985  23-11-19      529.285714
8    534  23-11-20      555.285714
9    987  23-11-21      617.428571

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:  

Date  
0 2023-01-01  
1 2023-01-02  
2 2023-01-03  
3 2023-01-04  
4 2023-01-05  
Your function should create the following DataFrame:  

Date Weekday  
0 2023-01-01 Sunday   
1 2023-01-02 Monday  
2 2023-01-03 Tuesday  
3 2023-01-04 Wednesday  
4 2023-01-05 Thursday  
The function should return the modified DataFrame.

In [45]:
date={'Date':['2023-01-01', '2023-01-02', '2023-01-03','2023-01-04','2023-01-05']}

Creating a DataFrame with Name **df**

In [46]:
df=pd.DataFrame(date)

Defing a Function which will add new Column with name **Weekdays**

In [47]:
def weekday(df):
    days=pd.Series(['Monday','Tuesday','Wednasday','Thursday','Friday'])
    df['Weekdays']=days

Calling a Function & Printing the DataFrame

In [48]:
weekday(df)
print(df)

         Date   Weekdays
0  2023-01-01     Monday
1  2023-01-02    Tuesday
2  2023-01-03  Wednasday
3  2023-01-04   Thursday
4  2023-01-05     Friday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [58]:
date_dict ={'Date': ['2023-01-01 08:00:00',
  '2023-01-02 08:00:00',
  '2023-01-03 08:00:00',
  '2023-01-04 08:00:00',
  '2023-01-05 08:00:00',
  '2023-01-06 08:00:00',
  '2023-01-07 08:00:00',
  '2023-01-08 08:00:00',
  '2023-01-09 08:00:00',
  '2023-01-10 08:00:00',
  '2023-01-11 08:00:00',
  '2023-01-12 08:00:00',
  '2023-01-13 08:00:00',
  '2023-01-14 08:00:00',
  '2023-01-15 08:00:00',
  '2023-01-16 08:00:00',
  '2023-01-17 08:00:00',
  '2023-01-18 08:00:00',
  '2023-01-19 08:00:00',
  '2023-01-20 08:00:00',
  '2023-01-21 08:00:00',
  '2023-01-22 08:00:00',
  '2023-01-23 08:00:00',
  '2023-01-24 08:00:00',
  '2023-01-25 08:00:00',
  '2023-01-26 08:00:00',
  '2023-01-27 08:00:00',
  '2023-01-28 08:00:00',
  '2023-01-29 08:00:00',
  '2023-01-30 08:00:00',
  '2023-01-31 08:00:00',
  '2023-02-01 08:00:00',
  '2023-02-02 08:00:00',
  '2023-02-03 08:00:00',
  '2023-02-04 08:00:00',
  '2023-02-05 08:00:00',
  '2023-02-06 08:00:00',
  '2023-02-07 08:00:00',
  '2023-02-08 08:00:00',
  '2023-02-09 08:00:00',
  '2023-02-10 08:00:00',
  '2023-02-11 08:00:00',
  '2023-02-12 08:00:00',
  '2023-02-13 08:00:00',
  '2023-02-14 08:00:00']}

Creating a DataFrame from above data

In [59]:
df=pd.DataFrame(date_dict)

Defining a Function which will print the row from 23-01-01 to 23-01-31

In [77]:
def selector(df):
    s='2023-01-01 08:00:00'
    e='2023-01-31 08:00:00'
    si=df[df['Date']==s].index
    ei=df[df['Date']==e].index
    d=df['Date'][si[0]:ei[0]]
    return d

Calling a Function

In [78]:
selector(df)

0     2023-01-01 08:00:00
1     2023-01-02 08:00:00
2     2023-01-03 08:00:00
3     2023-01-04 08:00:00
4     2023-01-05 08:00:00
5     2023-01-06 08:00:00
6     2023-01-07 08:00:00
7     2023-01-08 08:00:00
8     2023-01-09 08:00:00
9     2023-01-10 08:00:00
10    2023-01-11 08:00:00
11    2023-01-12 08:00:00
12    2023-01-13 08:00:00
13    2023-01-14 08:00:00
14    2023-01-15 08:00:00
15    2023-01-16 08:00:00
16    2023-01-17 08:00:00
17    2023-01-18 08:00:00
18    2023-01-19 08:00:00
19    2023-01-20 08:00:00
20    2023-01-21 08:00:00
21    2023-01-22 08:00:00
22    2023-01-23 08:00:00
23    2023-01-24 08:00:00
24    2023-01-25 08:00:00
25    2023-01-26 08:00:00
26    2023-01-27 08:00:00
27    2023-01-28 08:00:00
28    2023-01-29 08:00:00
29    2023-01-30 08:00:00
Name: Date, dtype: object

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The primary library that needs to be imported to use the basic functions of Pandas is pandas itself. The conventional way to import Pandas is using the following import statement

In [79]:
import pandas as pd

 import statement allows you to access Pandas functions and methods using the pd alias  
 After importing Pandas in this way, you can use Pandas functions and objects like DataFrames and Series by prefixing them with pd  
for example:  
pd.DataFrame() to create a DataFrame  
pd.Series() to create a Series  
pd.read_csv() to read data from a CSV file into a DataFrame  
pd.concat() to concatenate DataFrames  
pd.merge() to merge DataFrames